Revit 2025 API
StickSymbolLocation Enumeration
 Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StickSymbolLocation
Public Enumeration StickSymbolLocation
public enum class StickSymbolLocation
type StickSymbolLocation
Members
Member name | Value | Description
StickViewCenter | 0
StickViewTop | 1
StickViewBottom | 2
StickViewLocLine | 3
See Also
Reference
Autodesk.Revit.DB Namespace